{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kT43SxDgMGzbeXpO51f0hQ", "review_id": "0xuZfa0t4MNWd3eIFF02ug", "stars": 5, "date": "2009-06-09", "text": "I'm a fan of soft serve ice cream and Guptill's Coney Express has delicious ice cream with many flavors.  I've tried Kurver Kreme in Colonie, Tastee Freeze in Delmar and Country Drive Inn in Clifton Park, but I think that this place has the best soft serve ice cream.  The portions are generous and the taste is very rich.  For example, the brownie sundae is decadently delicious but likely too much for one person.  They also have cupcake sundaes which I am looking to try soon!", "type": "review", "business_id": "wbpbaWBfU54JbjLIDwERQA"}{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T9hGHsbJW9Hw1cJAlIAWmw", "review_id": "bBqVqhOvNgFs8I1Wk68QUQ", "stars": 5, "date": "2011-02-17", "text": "The nurses here were very  attentive and wonderful. I was able to have the same surgical nurse that I had for another procedure a few years ago. The anesthesiologist listened to my concerns and acting skillfully and compassionately. I felt well taken care of there.", "type": "review", "business_id": "4iTRjN_uAdAb7_YZDVHJdg"}{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Z_WAxc4RUpKp3y12BH1bEg", "review_id": "fu7TcxnAOdnbdLcyFhMmZg", "stars": 4, "date": "2011-11-12", "text": "Pretty great!  Okay, so this place is obviously not Vegan since they have a bunch of cheese and egg offerings, BUT I see that they do offer plenty of vegan alternatives.\n\nI was sort of skeptical being here because the prices were pretty hefty, I felt.  I guess it looked like a fast-food/diner joint, but it charged a little more. \n\nAnyway, their homemade hot sauce is AMAZING.  I got the eggs benedict for dinner and J got an omelet.  Both were really good.  I do love their homefries.. but the next time I come here, I want onion rings or fries.  Those onion rings looked amazing.\n\nLastly, the food came relatively quickly.\n\nNot a fan of the service.  They tried to seat us at this edge facing the stoves, without asking, so I asked for a booth.  Then at the booth, the server didn't refill waters very well but didn't feel bad emphasizing over and over whether or not we wanted their $5-7 desserts.  Honestly, a slice of pie for $6.50?  Veggie Galaxy, you are t r i p p i n !\n\nBut great food! (especially breaky!)", "type": "review", "business_id": "qw5gR8vW7mSOK4VROSwdMA"}{"votes": {"funny": 10, "useful": 10, "cool": 10}, "user_id": "OlMjqqzWZUv2-62CSqKq_A", "review_id": "LMy8UOKOeh0b9qrz-s1fQA", "stars": 4, "date": "2008-07-02", "text": "The Tale of the 4-Starred, Up Close and Personal Bar.\n\nThe Back Abbey is a bar that is located in the charming West Village part of Claremont. The area resembles the old shopping strip-meets-new shopping strip of San Luis Obispo.  What they did -- or so I've been told -- is that they've managed to preserve the old strip, leaving it looking the way it presumably did in the 70s.  Rhino Records is located in the older part.  The Back Abbey in the new part.  Both distinct areas of their aesthetic and consumer pull. \n\nThe Back Abbey specializes in Belgian draft beer.  They carry some German and English beer, as well.\n\nWow, the selection of beer. Let me tell you! A lof of them I have never heard of. I tasted the Augustijn (Belgian) and the Hofbrau Original (German).  Both were good, but I prefer the Hofbrau.They come in different sized glasses, with the Hofbrau coming in a long glass. The Augustijn was $9, and the Hofbrau $6. The Hofbrau came in the larger glass, so the Augustijn must be considered some premium brew for it to be in a smaller glass and come knocking down doors at a mighty $9.  \n\nI liked the overall aesthetics of the place. There is an up-close-and-personal feel to the bar. Along with the standard bar and barstools set-up, there's a long table that goes from one end of the bar to the other. People sit across from each other and, since the tables are not wide, you're not far at all from the person sitting in front of you. Like I wrote earlier, up close and personal is what this bar has going for it.\n\nThey have a food menu, as well. Above their draft selection of beer, they have a chalkboard placed high up with a list of what they serve. For those veggies among us, they even make a veggie burger.\n\nLastly, the patrons all seem to know each other. Maybe it's the small town mentality. But it's not exactly a backwards, hick town. It's very much modern in certain ways, and people just love to talk. Couple that with brew, and there's a lot of talk going on.\n\nI had a discussion with someone at the bar, who bartends at a bar not too far from The Back Abbey, and he told me that the Augustijn is the oldest beer recipe known to man. (Ah, ok. Old is vintage. Vintage is expensive. Thus, Augustijn is expensive.  And two + two = four. I got this down, partna'.)   Again, can we give it up for \"up close and personal\"?\n\nAnd, lastly, the bartenders were very attentive and enjoyed talking about the difference between the brews. The goateed gentlemen was specifically patient in describing which ones were Belgian, German, and English.\n\nThe mantra of this review should be \"up close and personal.\"  This is what this 4-star bar is all about.", "type": "review", "business_id": "81IjU5L-t-QQwsE38C63hQ"}{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fs5bpfk-2pvq2v8S1De5pQ", "review_id": "JjyRj9EiBXQTFDQAxRtt4g", "stars": 2, "date": "2012-07-25", "text": "As a vegan, I try to support places that are not wholly vegetarian, but that made the effort to put a vegetarian section on their menu, to show them that it's worth keeping. Thai Singha House does indeed have a section of their menu that reads vegetarian, but, unfortunately, their definition of vegetarian is different from mine.\n\nAll of the vegetarian curries, I was fortunately informed upon asking, do indeed contain fish sauce, which is an ingredient in the curry itself, and cannot be omitted.\n\nMy server suggested the pad thai as a fish-free vegetarian alternative, which I ordered, holding the egg. When it arrived, there appeared to be tofu in there and no egg, which was a good sign. But after a few blind, trusting bites I quickly realized that there was also chicken or pork mixed in as well. My server graciously took it back and honored my request for a house salad, of which I wasn't charged.\n\nI don't blame Thai Singha House for not understanding the definition of vegetarian (sadly, I know a few \"vegetarians\" who just don't eat red meat) although there are non-vegetarian Thai restaurants that get it and get it right, like Tamarind on South Street. \n\nSo, it's up to us as consumers to ask questions beforehand if we're not totally sure. And this is probably wise at any place where there is an ethnic and language barrier (On a related note, don't be fooled into thinking you can get vegan pho in Philly. It does not exist. You're eating beef broth or non-pho water broth, but not pho made with vegetable stock.)", "type": "review", "business_id": "Hnz1_h_D1eHSRtQqHSCZkw"}{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "jm0kgXVEdcQ_tQNzsoNXRw", "review_id": "Zht8FVW5a9wfU3u2_dmypQ", "stars": 4, "date": "2009-09-15", "text": "On a recent visit to SLO, I got taken out to the Natural Cafe, which bears a distinct resemblance to some of the places I remember from growing up in Berkeley. Very natural woodsy, with just enough sprouts on the sandwich to add a little crunch.  It's casual, with counter service only.\n\nMy turkey burger was not too dry, but the guacamole and special sauce helped it along in the moistness department. I didn't walk away from the meal feeling all gross and over full like you would with a normal burger and fries.  Yeah for whole grains and veggies!", "type": "review", "business_id": "ZRm8fSEBn8DsSLD4o7T4hQ"}{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1IzWxAfxuHTnzKOupUOB5Q", "review_id": "85TbS2RT5f6kqZ5l7_jfRw", "stars": 4, "date": "2010-09-19", "text": "Great place! \n\nI have to say the menu and the outdoor seating keep us coming back.  The food is good -- had breakfast both times but some friends had lunch items. Definitely a great selection.  We've been at off-peak times so no waiting and better service. \n\nAll in all, it's no DZ Akins but it's definitely worth trying!", "type": "review", "business_id": "-tphABJRkegXV4Fr1ke4FQ"}